/*
**************************************************************************
* Нижегородский государственный технический университет *
* Лабораторная работа №1 . Задание 2 . *
* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович *
**************************************************************************
*/
#include <iostream>
#include <iomanip>
using namespace std;
int main(){
	char logo[]=
 "**************************************************************************\n"
 "* Нижегородский государственный технический университет *\n"
 "* Лабораторная работа №1 . Задание 2 . *\n"
 "* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович*\n"
 "**************************************************************************\n";
	cout << logo;
	int number;
	cout << "Введите число: ";
	cin >> number;
	cout << "dec: " << number << " | oct: " << setw(3) << oct << showbase << number << " | hex: " << hex << showbase << number << endl;
	return 0;
}
