/*
**************************************************************************
* Нижегородский государственный технический университет *
* Лабораторная работа №1 . Задание 3 . *
* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович *
**************************************************************************
*/
#include <iostream>
#include <iomanip>
using namespace std;
int main(){
	char logo[]=
 "**************************************************************************\n"
 "* Нижегородский государственный технический университет *\n"
 "* Лабораторная работа №1 . Задание 3 . *\n"
 "* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович*\n"
 "**************************************************************************\n";
	cout << logo;
	double number;
	cout << "Введите вещественное число: ";
	cin >> number;
	cout << setprecision(6) << number << endl;
	cout << scientific << showbase << setw(4) << number << endl;
	cout << fixed << setw(7) << number << endl;
	return 0;
}
