/*
**************************************************************************
* Нижегородский государственный технический университет *
* Лабораторная работа №4 . Задание 1. *
* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович *
**************************************************************************
*/
#include <iostream>
using namespace std;

int sumDigit(int num, int base) {
    int sum = 0;
    while (num > 0) {
        sum += num % base;
        num /= base;
    }
    return sum;
}
int main() {
     char logo[]=
 "**************************************************************************\n"
 "* Нижегородский государственный технический университет *\n"
 "* Лабораторная работа №4 . Задание 1. *\n"
 "* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович*\n"
 "**************************************************************************\n";
	cout << logo;
    int n;
    cout << "Введите размер массива: ";
    cin >> n;
    if(!cin.good() || n <= 0 || n > 40) {
        cout << "Неверный размер массива!" << endl;
        return 0;
    }
    int* arr = new int[n];//динамический массив

    cout << "Введите " << n << " натуральных чисел:" << endl;
    for(int i = 0; i < n; i++) {
        cin >> arr[i];
        if(!cin.good() || arr[i] <= 0) {
            cout << "Нужно ввести натуральное число" << endl;
            delete[] arr;
            return 0;
        }
    }
    cout << "Исходный массив: ";
    for(int i = 0; i < n; i++) {
        cout << arr[i] << " ";
    }
    cout << endl;
    for (int i = 0; i < n; i++) {
        if (arr[i] % 2 == 0) {
            arr[i] = sumDigit(arr[i], 4);
        } else {
            arr[i] = sumDigit(arr[i], 5);
        }
    }
    cout << "Преобразованный массив: ";
    for (int i = 0; i < n; i++) {
        cout << arr[i] << " ";
    }
    cout << endl;
    delete[] arr;
    return 0;
}
