/*
**************************************************************************
* Нижегородский государственный технический университет *
* Лабораторная работа №1 . Задание 6. *
* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович *
**************************************************************************
*/
#include <iostream>
#include <cmath>
using namespace std;
int main(){
	char logo[]=
 "**************************************************************************\n"
 "* Нижегородский государственный технический университет *\n"
 "* Лабораторная работа №1 . Задание 6. *\n"
 "* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович*\n"
 "**************************************************************************\n";
	cout << logo;
	int amountDeposit, termDeposit;
	float percentDeposit;
	cout << "Введите сумму вклада: ";
	cin >> amountDeposit;
	cout << "Введите срок вклада: ";
	cin >> termDeposit;
	cout << "Введите процентную ставку: ";
	cin >> percentDeposit;
	float sumDeposit = amountDeposit * pow((1 + percentDeposit/100), termDeposit);
	cout << "Итоговая сумма вклада: " << sumDeposit << endl;
}
