/*
**************************************************************************
* Нижегородский государственный технический университет *
* Лабораторная работа №1 . Задание 9. *
* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович *
**************************************************************************
*/
#include <iostream>
#include <cmath>
using namespace std;
int main(){
        char logo[]=
 "**************************************************************************\n"
 "* Нижегородский государственный технический университет *\n"
 "* Лабораторная работа №1 . Задание 9. *\n"
 "* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович*\n"
 "**************************************************************************\n";
	cout << logo;
    double a = 0.01, x = 0.12;
	double Y = sqrt(x * x + a);
	double Z = asin(x * x * x - a);
    cout << "Y = " << Y << endl;
	cout << "Z = " << Z << endl;
    return 0;
    }
