/*
**************************************************************************
* Нижегородский государственный технический университет *
* Лабораторная работа №2 . Задание 1. *
* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович *
**************************************************************************
*/
#include <iostream>
#include <cmath>
using namespace std;
int main(){
        char logo[]=
 "**************************************************************************\n"
 "* Нижегородский государственный технический университет *\n"
 "* Лабораторная работа №2 . Задание 1. *\n"
 "* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович*\n"
 "**************************************************************************\n";
	cout << logo;
    int number;
    cout << "Введите число: ";
    cin >> number;
    double sum = 0.0;
    for(int i = 0; i <= number; i++){
        sum += 1/pow(2,i) * pow(-1,i);
    }
    cout << "Сумма = " << sum << endl;
    return 0;
    }
