/*
**************************************************************************
* Нижегородский государственный технический университет *
* Лабораторная работа №2 . Задание 2. *
* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович *
**************************************************************************
*/
#include <iostream>
#include <cmath>
#include <iomanip>
using namespace std;
int main(){
        char logo[]=
 "**************************************************************************\n"
 "* Нижегородский государственный технический университет *\n"
 "* Лабораторная работа №2 . Задание 2. *\n"
 "* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович*\n"
 "**************************************************************************\n";
	cout << logo;
    double y, x = 0.05,xMax = 1.55, step = 0.05, median = 0.0, min, max; // добавить мин макс
    cout  << setw(2) << "N" << setw(6) << "x" << setw(10) << "y" << endl;
    y = 2 * pow(x, 5) - 4 / pow(x, 3) + 1 / x + 3 * sqrt(x);
    min = y;
    max = y;
    int count = 0;
    while(x < xMax + step){
        count++;
        y = 2 * pow(x, 5) - 4 / pow(x, 3) + 1 / x + 3 * sqrt(x);
        cout << right << setw(2) << count << setw(6) << fixed
        << setprecision(2) << x << setw(10) << fixed
        << setprecision(2) << y << endl; // добавить выравнивание по краю или по центру
        median += y;
        x += step;
        if(y < min){
            min = y;
        }
        if(y > max){
            max = y;
        }
    }
    median /= count;
    cout << "Среднее значение = " << median
    << "\nМинимальное значение = " << min
    << "\nМаксимальное значение = " << max << endl;
    return 0;
    }
