/*
**************************************************************************
* Нижегородский государственный технический университет *
* Лабораторная работа №3 . Задание 1. *
* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович *
**************************************************************************
*/
#include <iostream>
#include <cmath>
#include <iomanip>
using namespace std;
int main(){
        char logo[]=
 "**************************************************************************\n"
 "* Нижегородский государственный технический университет *\n"
 "* Лабораторная работа №3 . Задание 1. *\n"
 "* Выполнил студент группы 24-ВМв Ложкин Степан Владимирович*\n"
 "**************************************************************************\n";
	cout << logo;
    double x = 0, xMax = 3, step = 0.1;
    double y = log(x*x - 2 * x + 2);
    int n = (int) ((xMax-x)/step + 1); // количество измерений
    double arr[n][2];
    double yMin = y;
    double yMax = y;
    for(int i = 0; i < n; i++){
        x = i * step;
        y = log(x*x - 2 * x + 2);
        arr[i][0] = x;
        arr[i][1] = y;
        if(yMin > y){
            yMin = y;
        }
        if(yMax < y){
            yMax = y;
        }
    }
    cout << setw(2) << "N"
         << setw(8) << "X"
         << setw(9) << "Y"
         << endl;
    for (int i = 0; i < n; ++i) {
        cout << fixed << setprecision(2) << setw(2)  << i
             << setprecision(2) << setw(8)  << arr[i][0]
             << setprecision(4) << setw(9) << arr[i][1] << endl;
    }
    cout << "Максимальное значение: " << yMax << "\nМинимальное значение: " << yMin << endl;

    return 0;
}
